Repository: PasaOpasen/MathClasses
Catalog: Computator.NET-master/Computator.NET.Localization/Strings.*.resx
Languages: cs, de, pl

source: Expression should not be empty!
cs: Výraz nemůže být prázdný !
de: Ausdruck sollte nicht leer sein!
pl: Wyrażenie nie może być puste!

source: Add to chart
cs: Přidat do grafu
de: Ansicht hinzufügen
pl: Dodaj do wykresu

source: Draw chart
cs: Nakreslete
de: zeichnen Sie Diagramm
pl: Narysuj wykres

source: Error
cs: Chyba
de: Fehler
pl: Błąd

source: Given ε is not valid. ε should be small positive number.
cs: Uvedené ε je nesprávné. ε by mělo být malé kladné číslo .
de: Angesichts ε ist nicht gültig. ε sollten kleine positive Zahl sein.
pl: Podane ε jest niepoprawne. ε powinno być małą liczbą dodatnią.

source: Given ε is not valid.
cs: Uvedené ε je nesprávné.
de: Angesichts ε ist nicht gültig.
pl: Podane ε jest niepoprawne.

source: Console output:
cs: Výstup konzoli:
de: Konsolenausgabe:
pl: Wyjście konsoli:

source: Features:
cs: Vlastnosti:
de: Eigenschaften:
pl: Cechy:

# PleaseReportAnyBugsToPawełTrokaPtrokaFizykaDk
source: Please report any bugs to Paweł Troka - pawel.troka@outlook.com
cs: Nahlaste nám prosím jakékoliv chyby na ptroka@fizyka.dk - Paweł Troka.
de: Bitte melden Sie alle Bugs zu Paweł Troka - ptroka@fizyka.dk
pl: Proszę zgłaszać wszelkie błędy do Paweł Troka - pawel.troka@outlook.com

source: Bug reporting
cs: Hlášení chyb
de: Melden von Fehlern
pl: Raportowanie błędów

source: Chart
cs: Graf
de: Tabelle
pl: Wykres

source: It's features include:
cs: Mezi jeho vlastnosti patří :
de: Es ist Features sind:
pl: Jego cechy to:

source: source:
cs: Zdroj:
de: Quelle :
pl: źródło:

source: Error in expression syntax. One of used functions does not exist / is incompatible with given arguments or you just made a mistake writing expression.
cs: Syntaktická chyba ve výrazu . Jedna z používaných funkcí neexistuje / není v souladu s uvedenými argumenty , nebo prostě jste jen udělali chybu v zápisu.
de: Fehler in der Expression -Syntax. Eine der verwendeten Funktionen nicht vorhanden / ist mit angegebenen Argumenten nicht kompatibel , oder Sie gerade einen Fehler gemacht schriftlich Ausdruck .
pl: Błąd w składni wyrażenia. Jedna z używanych funkcji nie istnieje / jest niekompatybilna z podanymi argumentami lub po prostu popełniłeś błąd w zapisie wyrażenia.

source: Details:
cs: Podrobné informace:
pl: Szczegóły:

source: More details:
cs: Více informací :
de: Mehr Details :
pl: Więcej szczegółów:

source: No function to invoke
cs: Žádná funkce neni k vyvolání
de: Keine Funktion , die aufgerufen werden
pl: Brak funkcji do wywołania

# featuresInclude
source: - Real and complex functions charts - Real and complex calculator - Real functions numerical calculations including different methods - Over 107 Elementary functions - Over 141 Special functions - Over 21 Matrix functions and operations - Scripting language with power to easy computations including matrices - You can declare your own custom functions with scripting language
cs: - Grafy reálních a komplexních funkcí - Reální a komplexní kalkulačka - Výpočet skutečných numerických funkcí, včetně různých metod - Více než 107 elementárních funkcí - Více než 141 speciálních funkcí - Více než 21 funkcí a operací s maticemi - Výkonný skriptovací jazyk pro jednoduché výpočty , s ohledem na matice - Můžete deklarovat své vlastní funkce ve skriptovacím jazyce
de: - Reelle und komplexe Funktionen Charts - Reelle und komplexe Rechner - Real -Funktionen numerische Berechnungen einschließlich verschiedener Methoden - Über 107 Grundfunktionen - Über 141 Sonderfunktionen - Über 21 Matrix -Funktionen und Operationen - Skriptsprache mit der Macht, einfach Berechnungen einschließlich Matrizen - Sie können Ihre eigenen benutzerdefinierten Funktionen mit Skriptsprache erklären
pl: - Wykresy funkcji rzeczywistych i zespolonych - Rzeczywisty i zespolony kalkulator - Obliczenia numeryczne na funkcjach rzeczywistych, z uwzględnieniem różnych metod - Ponad 107 funkcji elementarnych - Ponad 141 funkcji specjalnych - Ponad 21 funkcji i operacji działających na macierzach - Potężny język skryptowy do prostych obliczeń, uwzględniając macierze - Możesz zadeklarować własne niestandardowe funkcje z języka skryptowego

source: Memory allocation speed test cancelled by user
cs: Test výkonnosti alokace paměti byl zrušen uživatelem
de: Speicherzuweisung Speed-Test wurde vom Benutzer abgebrochen
pl: Test wydajności alokacji pamięci anulowany przez użytkownika

source: Memory allocation speed test done succesfully, check out your points result
cs: Test výkonnosti alokace paměti úspěšně ukončený - zkontrolujte výsledky
de: Speicherzuweisung Speed-Test erfolgreich durchgeführt , überprüfen Sie Ihre Punkte führen
pl: Test wydajności alokacji pamięci wykonano pomyślnie, sprawdź swoje wyniki

source: Done!
cs: Hotovo
de: Fertig !
pl: Gotowe!

source: result:
cs: Výsledek:
de: Ergebnis :
pl: wynik:

source: Points!
cs: Body!
de: Punkte!
pl: Punkty!

source: Canceled!
cs: Zrušeno!
de: Abgesagt!
pl: Odwołany!

source: Math functions calculation speed test done succesfully! Check out your points results!
cs: Test výkonu pro výpočet matematických funkcí byl úspěšně proveden! Zkontrolujte vaše skóre!
de: Mathematische Funktionen Berechnung Geschwindigkeitstest erfolgreich durchgeführt ! Überprüfen Sie Ihre Punkte Ergebnisse!
pl: Test wydajności obliczania matematycznych funkcji wykonano pomyślnie! Sprawdź swoje wyniki!

source: Math functions calculation speed test cancelled by user.
cs: Test výkonu pro výpočet matematických funkcí byl zrušen uživatelem .
de: Mathematische Funktionen Berechnung Geschwindigkeitstest vom Benutzer abgebrochen.
pl: Test wydajności obliczania matematycznych funkcji anulowany przez użytkownika.

source: libraries used
cs: používáne knihovny
de: verwendeten Bibliotheken
pl: biblioteki używane

source: beta testers
cs: beta testery
de: beta-Tester
pl: beta testerzy

source: other contributors
cs: ostatní účastníci
de: anderen Mitwirkenden
pl: inni uczestnicy

source: translators
cs: překladatelé
de: Übersetzer
pl: tłumacze

source: Special thanks to:
cs: Zvláštní poděkování patří:
de: Besonderen Dank an:
pl: Specjalne podziękowania dla:

source: | X/Y ratio = {0} |
cs: | X / Y poměr = {0} |
de: | X / Y - Verhältnis = {0} |
pl: | X/Y stosunek = {0} |

source: Only Real mode is supported in Numerical calculations right now, more to come in next versions!
pl: Tylko tryb rzeczywisty jest wspierany w obliczeniach numerycznych na daną chwilę, więcej trybów w kolejnych wersjach!

source: Computator.NET is a special kind of numerical software that is fast and easy to use but not worse than others feature-wise.
pl: Computator.NET to wyjątkowy program do obliczeń numerycznych, taki który jest szybki i łatwy w użyciu ale nie gorszy niż inne pod względem możliwości.

source: Chart3D classes are based on code from High performance WPF 3D Chart rev.6 application on license
pl: Klasy Chart3D bazują na kodzie aplikacji High performance WPF 3D Chart rev.6, opublikowanej na licencji

# GlobalConfig_others_standard_algorithm_for_complex_domain_coloring
source: standard algorithm for complex domain coloring
pl: standardowy algorytm dla zespolonego kolorowania domeny

# AddTab_NewFile
source: NewFile
pl: NowyPlik

source: Close tabs to the left
pl: Zamknij karty na lewo

source: Close tabs to the right
cs: Zavri karty z prave strany
de: Tabs schließen nach rechts
pl: Zamknij karty na prawo

source: Close other tabs
pl: Zamknij inne karty

source: Close tab
pl: Zamknij kartę

source: Clone tab
pl: Sklonuj kartę

source: New tab
pl: Nowa karta

# Functions_and_Constants_Details
source: Functions & Constants Details
pl: Funkcje i Stałe - Szczegóły

source: Number of steps should be small, default is 6
pl: Liczba kroków powinna być mała, domyślne jest 6

source: Unhandled UI Exception
pl: Nieobsłużony wyjątek interfejsu użytkownika

# Program_Application_ThreadException_Unhandled_Thread_Exception
source: Unhandled Thread Exception
pl: Nieobsłużony wyjątek wątku

source: The invalid characters are: '@','.', ',', '!'
pl: Niepoprawne znaki to: '@','.', ',', '!'

source: The label cannot be blank
pl: Nazwa nie może być pusta

source: Invalid label.
pl: Niepoprawna nazwa.

source: Label edit error
pl: Błąd edycji nazwy

source: Delete file
pl: Usuń plik

source: Rename file
pl: Zmień nazwę pliku

# Directory_tree_New_file
source: New file
pl: Nowy plik

source: Changelog
pl: Lista zmian

source: You dont have any logs yet.
pl: Nie masz jeszcze żadnych logów.

source: Warning!
pl: Ostrzeżenie!

source: -Check "Real : f(x)" mode
pl: -Wybierz tryb "Rzeczywisty : f(x)"

source: Or even better report them on project site, using link below
pl: Albo nawet lepiej zgłoś je na stronie projektu, używając poniższego linku

# NativeCompiler_error
source: error
pl: błąd

# NativeCompiler_warning
source: warning
pl: ostrzeżenie

# NativeCompiler_Column
source: Column
pl: Kolumna

# NativeCompiler_Line
source: Line
pl: Linia

source: Script errors
pl: Błędy w skrypcie

source: Expression errors
pl: Błędy w wyrażeniu

source: Custom functions errors
pl: Błędy w funkcjach własnych

source: Internal errors
pl: Błędy wewnętrzne

source: Syntax error
cs: Chyba syntaxe
de: Syntax Fehler
pl: Błąd składni

source: Exception during startup
cs: Vyjimka pri nastartovani
pl: Wyjątek podczas uruchamiania

source: Error code
pl: Kod błędu

source: Reason
pl: Powód

source: at line
pl: w linii

source: Exception occcured in
pl: Wyjątek zdarzył się w

source: exception
pl: wyjątek

# Program_CurrentDomain_UnhandledException_Try_installing_font_
source: Try installing font!
pl: Spróbuj zainstalować czcionkę!

source: Check chart area values
pl: Sprawdź wartości obszaru wykresu

source: Min value needs to be less than Max value.
pl: Wartość Min musi być mniejsza od wartości Max

source: needs to be less than
pl: musi być mniejsze niż

source: needs to be greater than
pl: musi być większe niż

source: Chart3D is not supported on Mono
pl: Chart3D nie jest wspierany na Mono

source: secant Newton Raphson method
pl: metoda siecznych Newton-Raphson

source: secant method
pl: metoda siecznych

source: bisection method
pl: metoda bisekcji

source: Brent's method
pl: metoda Brenta

source: Broyden's method
pl: metoda Broydena

source: infinity-adaptive Gauss–Kronrod method
pl: nieskończenie-adaptacyjna metoda Gauss-Kronrod

source: non-adaptive Gauss–Kronrod method
pl: nie-adaptacyjna metoda Gauss-Kronrod

source: centered five-point method
pl: wyśrodkowana metoda 5-punktów

source: stable finite difference formula
pl: stabilna skończona różnica

source: two-point finite difference formula
pl: 2-punktowa skończona różnica

source: finite difference formula
pl: skończona różnica

source: centered order-point method
pl: wyśrodkowana metoda n-punktów

source: Function root
pl: Miejsca zerowe funkcji

source: Derivative
pl: Pochodna

source: Integral
pl: Całka

source: Romberg's method
pl: metoda Romberga

source: Monte Carlo method
pl: metoda Monte Carlo

source: double exponential transformation
pl: podwójna eksponencjalna transformacja

source: Simpson's method
pl: metoda Simpsona

source: rectangle method
pl: metoda prostokątów

source: trapezoidal method
pl: metoda trapezów
